[M_Sage_FollowGlow MissionDefinition]
MissionName="See the letter"
MissionDescription="TO RENT OUT saw an angry tribe walking through the forest. He wants you to save Pandora from the evil PP once and for all.."
TurnInDescription="surprise! Now go take a bath."
MissionSummary="Close the transmission chain.."
MissionGiver="He clapped his hands"
MissionTurnInLocation="Claptrap"
TeaserText="You have to go..."

[M_Sage_FollowGlow:FindCreature MissionObjectiveDefinition]
ProgressMessage="Follow the path of nature"

[M_Sage_FollowGlow:FindCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_FollowGlow:FindTracks MissionObjectiveDefinition]
ProgressMessage="Discover your creativity"

[M_Sage_FollowGlow:FindTrackSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_FollowGlow:KillCreature MissionObjectiveDefinition]
ProgressMessage="to kill the Babylonians"

[M_Sage_FollowGlow:KillCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

